Revit 2024 API
Noise.NoiseType Property
 The property labeled "Noise Type" from the "Noise" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string NoiseType { get; }
Visual Basic
Public Shared ReadOnly Property NoiseType As String
	Get
Visual C++
public:
static property String^ NoiseType {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "NoiseType".
See Also
Noise Class
Autodesk.Revit.DB.Visual Namespace